Revit 2024 API
PerformanceAdviser.ExecuteRules Method (Document, IList<PerformanceAdviserRuleId>)
 Executes selected rules on a given document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public IList<FailureMessage> ExecuteRules(
	Document document,
	IList<PerformanceAdviserRuleId> rules
)
Visual Basic
Public Function ExecuteRules ( _
	document As Document, _
	rules As IList(Of PerformanceAdviserRuleId) _
) As IList(Of FailureMessage)
Visual C++
public:
IList<FailureMessage^>^ ExecuteRules(
	Document^ document,
	IList<PerformanceAdviserRuleId^>^ rules
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 Document on which the rules will be executed.
rules
Type: System.Collections.Generic.IList<PerformanceAdviserRuleId>
 Ids of rules to be executed.
Return Value
 Failure messages explaining performance problems detected in the document.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
PerformanceAdviser Class
ExecuteRules Overload
Autodesk.Revit.DB Namespace